app/controllers/admin/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    # If each user belongs to a single project, you can find all users with this project_id
    @users = User.where(project_id: @project.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."project_id" = $1  [["project_id", 2]]

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Paws & Claws"], ["description", "Images"], ["user_id", nil], ["created_at", "2024-12-24 17:25:04.321564"], ["updated_at", "2024-12-24 17:25:04.321564"]]

  def destroy
    @project = Project.find(params[:id])
    if @project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 3]]