app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)
    # Default role to 'user' unless you manually assign 'admin'
    @user.role ||= "user"

    # Explicitly handle project assignment
    if params[:user][:project_id].present?
      @user.project_id = params[:user][:project_id]
    end

    if @user.save
---
INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @user = User.find(params[:id])

    # If password fields are blank, don't overwrite the existing password
    update_params = if user_params[:password].blank?
      user_params.except(:password, :password_confirmation)
    else
      user_params
    end

    if @user.update(update_params)
      redirect_to admin_users_path, notice: "User updated successfully."
    else
      flash.now[:alert] = "Failed to update user: #{@user.errors.full_messages.join(', ')}"
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "project_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-12-24 17:29:52.924821"], ["project_id", 2], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def destroy
    @user = User.find(params[:id])
    if @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]