app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."user_id" = $1 AND "images"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "images" SET "updated_at" = $1, "notes" = $2 WHERE "images"."id" = $3  [["updated_at", "2024-12-26 22:55:00.510884"], ["notes", "hello?"], ["id", 3]]
---
  def update_notes
    @image = current_user.images.find_by(id: params[:id]) # Find image that belongs to the user
    if @image.nil?
      render json: { success: false, errors: ["Image not found or does not belong to you"] }, status: :not_found
      return
    end

    if @image.update(notes: params[:notes])

SELECT "images".* FROM "images" WHERE "images"."user_id" = $1 AND "images"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 57], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 57]]
---
  def destroy
    @image = current_user.images.find_by(id: params[:id]) # Ensure the image belongs to the user
    if @image.nil?
      redirect_to images_path, alert: "Image not found or does not belong to you."
      return
    end

    @image.destroy