app/controllers/stock_images_controller.rb

  def search
    query = params[:query]
    transparent = params[:transparent] == 'true'
    page = params[:page].presence || 1
    per_page = params[:per_page].presence || 10

    return render json: [] if query.blank?

    begin
      # Fetch images using the StockImageService with pagination
      images = StockImageService.fetch_images(query, transparent: transparent, page: page, per_page: per_page)

      # Collect the selected image URLs for the current user
      user_selected_urls = current_user.images.pluck(:url)
---
SELECT "images"."url" FROM "images" WHERE "images"."user_id" = $1  [["user_id", 1]]

  def select
    @image = Image.new(
      url: params[:url],
      source: params[:source],
      attribution: params[:attribution],
      user: current_user,
      project: current_user.project
    )

    if @image.save
---
INSERT INTO "images" ("url", "source", "attribution", "user_id", "project_id", "created_at", "updated_at", "notes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"