app/views/admin/users/_form.html.erb

    <%= form.label :project_id, "Project", class: "block font-semibold mb-1 text-gray-700 dark:text-white" %>
    <%= form.collection_select :project_id, Project.all, :id, :name,
                              { include_blank: "No Project" },
                              { class: "border border-gray-300 rounded px-3 py-2 w-full dark:bg-gray-700 dark:border-gray-600 dark:text-white" } %>
---
SELECT "projects".* FROM "projects"